; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v8)
		(pred_4 ?v7)
		(pred_5 ?v2)
		(pred_1 ?v2)
		(pred_6 ?v7 ?v2)
		(pred_3)
		(pred_2 ?v7))

   (:action op_1
       :parameters  (?v6 ?v5)
       :precondition (and (not-eq ?v6 ?v5) 
                          (pred_5 ?v6) (pred_5 ?v5) (pred_1 ?v6))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v6))))


   (:action op_3
       :parameters (?v4 ?v1)
       :precondition  (and  (pred_4 ?v4) (pred_5 ?v1)
			    (pred_6 ?v4 ?v1) (pred_1 ?v1) (pred_3))
       :effect (and (pred_2 ?v4)
		    (not (pred_6 ?v4 ?v1)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v4  ?v1)
       :precondition  (and  (pred_4 ?v4) (pred_5 ?v1)
			    (pred_2 ?v4) (pred_1 ?v1))
       :effect (and (pred_6 ?v4 ?v1)
		    (pred_3)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_04 obj_07 
          obj_02 obj_03 obj_05 
)
(:init
(pred_5 obj_06)
(pred_5 obj_01)
(pred_5 obj_04)
(pred_5 obj_07)
(pred_4 obj_02)
(pred_4 obj_03)
(pred_4 obj_05)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(pred_3)
(pred_6 obj_02 obj_04)
(pred_6 obj_03 obj_06)
(pred_6 obj_05 obj_04)
(pred_1 obj_07)
)
(:goal
(and
(pred_6 obj_02 obj_01)
(pred_6 obj_03 obj_04)
(pred_6 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_02 obj_01) (pred_1 obj_06))
    (sometime-before  (pred_6 obj_03 obj_04) (pred_1 obj_01))
  )
)
)

; plan
1. (op_1 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_04)
   goals met: 1 of 3
2. (op_3 obj_02 obj_04)
   deleted: (pred_6 obj_02 obj_04) (pred_3)
   added: (pred_2 obj_02)
   goals met: 1 of 3
3. (op_1 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 1 of 3
5. (op_2 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_6 obj_02 obj_06) (pred_3)
   goals met: 1 of 3
6. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_03 obj_06) (pred_3)
   added: (pred_2 obj_03)
   goals met: 1 of 3
7. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 1 of 3
8. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_6 obj_03 obj_04) (pred_3)
   goals met: 2 of 3
9. (op_1 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 2 of 3
10. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 2 of 3
11. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02 obj_06) (pred_3)
   added: (pred_2 obj_02)
   goals met: 2 of 3
12. (op_1 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 2 of 3
13. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_6 obj_02 obj_01) (pred_3)
   goals met: 3 of 3
